backend/app/controllers/posts_controller.rb

    def index
        posts = Post.all
---
SELECT "posts".* FROM "posts"

    def show
        post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        puts params
        vote = 0
        date = Time.now
        date.strftime("%B %d, %Y")
        # date = '2020, 5, 31'

        post = Post.create(title: params[:post][:title], message: params[:post][:message], image: params[:post][:image], date: date, vote: vote)
---
INSERT INTO "posts" ("title", "message", "image", "vote", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        post = Post.find_by(id: params[:postId])
        puts post
        post.vote += 1
        puts post.vote
        if post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "vote" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["vote", 20], ["updated_at", "2020-06-19 03:50:53.881389"], ["id", 2]]